load-tests/results/high-traffic-p95fix-finalcandidate-500x10000/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/load-tests/k6/high-traffic-500vu-10000.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 10m30s max duration (incl. graceful stop):
              * high_traffic_booking: 10000 iterations shared among 500 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

running (00m02.9s), 500/500 VUs, 575 complete and 0 interrupted iterations
high_traffic_booking   [   6% ] 500 VUs  00m00.8s/10m0s  00575/10000 shared iters

running (00m03.9s), 500/500 VUs, 1882 complete and 0 interrupted iterations
high_traffic_booking   [  19% ] 500 VUs  00m01.8s/10m0s  01882/10000 shared iters

running (00m04.9s), 500/500 VUs, 3825 complete and 0 interrupted iterations
high_traffic_booking   [  38% ] 500 VUs  00m02.8s/10m0s  03825/10000 shared iters

running (00m05.9s), 500/500 VUs, 6340 complete and 0 interrupted iterations
high_traffic_booking   [  63% ] 500 VUs  00m03.8s/10m0s  06340/10000 shared iters

running (00m06.9s), 500/500 VUs, 9032 complete and 0 interrupted iterations
high_traffic_booking   [  90% ] 500 VUs  00m04.8s/10m0s  09032/10000 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 20000   2784.602448/s
    checks_succeeded...: 100.00% 20000 out of 20000
    checks_failed......: 0.00%   0 out of 20000

    ✓ reservation response has an id
    ✓ reservation response is pending

    CUSTOM
    cancellations_succeeded............: 0      0/s
    errors_idempotency_in_progress.....: 0      0/s
    errors_rate_limited................: 0      0/s
    errors_sold_out....................: 0      0/s
    errors_user_limit..................: 0      0/s
    reservation_server_faults..........: 0      0/s
    reservation_unexpected_responses...: 0      0/s
    reservations_accepted..............: 10000  1392.301224/s
    reservations_created...............: 10000  1392.301224/s
    reservations_replayed..............: 0      0/s
    reserve_latency....................: avg=247.02ms min=98.69ms med=213.78ms p(90)=388.33ms p(95)=431.87ms p(99)=530.89ms max=632.24ms

    HTTP
    http_req_duration..................: avg=247.15ms min=98.69ms med=213.79ms p(90)=388.62ms p(95)=431.94ms p(99)=533.84ms max=1.03s   
      { expected_response:true }.......: avg=247.15ms min=98.69ms med=213.79ms p(90)=388.62ms p(95)=431.94ms p(99)=533.84ms max=1.03s   
    http_req_failed....................: 0.00%  0 out of 10003
    http_reqs..........................: 10003  1392.718914/s

    EXECUTION
    iteration_duration.................: avg=249.52ms min=99.06ms med=214.39ms p(90)=399.04ms p(95)=439.78ms p(99)=560.33ms max=724.22ms
    iterations.........................: 10000  1392.301224/s
    vus................................: 500    min=0          max=500
    vus_max............................: 500    min=500        max=500

    NETWORK
    data_received......................: 7.7 MB 1.1 MB/s
    data_sent..........................: 5.9 MB 819 kB/s



running (00m07.2s), 000/500 VUs, 10000 complete and 0 interrupted iterations
high_traffic_booking ✓ [ 100% ] 500 VUs  00m05.1s/10m0s  10000/10000 shared iters